---
kind: property
id: P:Autodesk.Revit.DB.ReferencePlane.Normal
source: html/81807bea-c248-31ae-e28f-a9edc50e9ce1.htm
---
# Autodesk.Revit.DB.ReferencePlane.Normal Property

The normal vector of the reference plane.

## Syntax (C#)
```csharp
public XYZ Normal { get; }
```